Конфигурация/DataProcessors/ПросмотрКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПросмотрКниги</Name>
			<Comment>Встроенный просмотр книги материала: предрендеренные PNG-страницы в поле HTML-документа, листание.</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Catalogs/МатериалыБиблиотеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МатериалыБиблиотеки</Name>
			<Comment>Учебные материалы (учебники, справочники, методические пособия и т. п.)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМатериаловБиблиотеки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БиблиографическоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеСлова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодИздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Издательство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISBN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКниги</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаКниги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницыКниги</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПривязкиКТемам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Темы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/ПросмотрКниги/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Готовит форму просмотра книги по параметру МатериалИД (строковый GUID): определяет
// число предрендеренных страниц и показывает первую. Заголовок окна = наименование
// материала. Если страниц нет - показывается заглушка "Книга недоступна".
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИДМатериала = "";
	Параметры.Свойство("МатериалИД", ИДМатериала);

	ИмяКниги = "Книга недоступна";
	ТекущаяСтраница = 0;
	ВсегоСтраниц = 0;

	Если ЗначениеЗаполнено(ИДМатериала) Тогда
		МатериалСсылка = Справочники.МатериалыБиблиотеки.ПолучитьСсылку(
			Новый УникальныйИдентификатор(ИДМатериала));
		Заголовок = СокрЛП(МатериалСсылка.Наименование);

		ИмяФайла = МатериалСсылка.ИмяФайлаКниги;
		ИмяКниги = ?(ЗначениеЗаполнено(ИмяФайла), ИмяФайла, СокрЛП(МатериалСсылка.Наименование));

		ВсегоСтраниц = ЧислоСтраниц(МатериалСсылка);
		ТекущаяСтраница = ?(ВсегоСтраниц > 0, 1, 0);
	КонецЕсли;

	ПоказатьСтраницу();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Листание: якорные ссылки data-act=пред/след внутри HTML. Гасим штатную навигацию
// поля и пересобираем HTML под новую страницу на сервере.
&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Якорь = ДанныеСобытия.Anchor;

	Если Якорь = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	Действие = Якорь.getAttribute("data-act");

	Если Действие = "след" Тогда
		ПерейтиНаСтраницу(1);
	ИначеЕсли Действие = "пред" Тогда
		ПерейтиНаСтраницу(-1);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Смещает текущую страницу на Дельта (в пределах книги) и перерисовывает.
&НаКлиенте
Процедура ПерейтиНаСтраницу(Знач Дельта)

	Новая = ТекущаяСтраница + Дельта;

	Если Новая >= 1 И Новая <= ВсегоСтраниц Тогда
		ТекущаяСтраница = Новая;
		ПоказатьСтраницу();
	КонецЕсли;

КонецПроцедуры

// Пересобирает ТекстHTML под текущую страницу: читает её PNG из реквизита
// СтраницыКниги, кодирует в base64 и подставляет в макет.
&НаСервере
Процедура ПоказатьСтраницу()

	СтраницаBase64 = "";

	Если ЗначениеЗаполнено(МатериалСсылка) И ВсегоСтраниц > 0 Тогда
		Страницы = МатериалСсылка.СтраницыКниги.Получить();
		Если ТипЗнч(Страницы) = Тип("Массив")
			И ТекущаяСтраница >= 1 И ТекущаяСтраница <= Страницы.Количество() Тогда

			Данные = Страницы[ТекущаяСтраница - 1];
			Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
				// Убираем переносы строк из base64 - чтобы корректно лёг в data:URI.
				Б64 = Base64Строка(Данные);
				Б64 = СтрЗаменить(Б64, Символы.ВК, "");
				СтраницаBase64 = СтрЗаменить(Б64, Символы.ПС, "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ТекстHTML = Обработки.ПросмотрКниги.ПолучитьМакетКакСтроку(
		ИмяКниги, ТекущаяСтраница, ВсегоСтраниц, СтраницаBase64);

КонецПроцедуры

// Возвращает число предрендеренных страниц материала (0, если их нет).
&НаСервереБезКонтекста
Функция ЧислоСтраниц(Знач Материал)

	Хранилище = Материал.СтраницыКниги;
	Если Хранилище = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Страницы = Хранилище.Получить();
	Возврат ?(ТипЗнч(Страницы) = Тип("Массив"), Страницы.Количество(), 0);

КонецФункции

#КонецОбласти
